app/controllers/concerns/api/v1/users_controller.rb

            def create
                # Step 1: Get the result from the service.
                result = MoveItApi::Users.new_user(params)
                # Step 2: Return an error if the result was unsuccessful.
                render_error(errors: "There was a problem creating a new user.", status: 400)
                # Step 3: Otherwise, build a payload.

                # Step 4: Return a successful response attached with the payload.

                if user.save
---
INSERT INTO "users" ("email", "username", "first_name", "last_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)